"""1. Реализовать скрипт, в котором должна быть предусмотрена функция расчёта заработной платы сотрудника. 
Используйте в нём формулу: (выработка в часах*ставка в час) + премия. 
Во время выполнения расчёта для конкретных значений необходимо запускать скрипт с параметрами."""


import python_1_1


print((python_1_1.time() * python_1_1.bid()) + python_1_1.premium())
